{
  "Body": "Justin’s parents are considering buying a new car and when that happens he will get the current family car. He will finally have\na car of his own! He wants to help his parents by creating a report that summarizes the purchase details for each of the cars they\nare considering.\n\nThey will be using a car loan to pay for most of the purchase so the information needed to help them make a decision is the\nmonthly payment, the final cost of the car after making the loan payments and the amount of interest that will have been paid.\nJustin has found the following formula for calculating the monthly payment.\n\n<img/>\n\nThe loan amount <b><i>a</i></b> is the purchase price less the down payment. The monthly interest rate <b><i>r</i></b> is 1/12 of the APR or annual\npercentage rate for the loan as a decimal value not a percentage. The number of monthly payments <b><i>n</i></b> and monthly payment\namount <b><i>p</i></b> are as expected. The monthly payment must be rounded to nearest penny; otherwise, partial pennies add up to extra\npennies after all payments.\n\nFor each car, calculate and display the monthly payment, final cost which is the total of all payments plus the down payment,\nand the amount of interest paid which is the total of payments less the purchase price.\n\nUsing first set of data as a sample:\n\n\tMonthly payment is $587.07\n\tFinal cost is $37224.20 [ 587.07 * 60 + 2000.00 ]\n\tInterest paid is $6236.79 [ 37224.20 – 30987.41 ]",
  "Input": "The first line contains an integer <b><i>T</i></b> which is the number of test cases with 3 ≤ <b><i>T</i></b> ≤ 20. Each of <b><i>T</i></b> following lines are one\ncomplete test case and will contain four pieces of data:\nPurchase price between and including $10,000.00 and $100,000.00\nDown payment <b><i>d</i></b> with $0.00 ≤ <b><i>d</i></b> ≤ $5000.00\nAPR as a percentage with 1.0000% ≤ <b><i>APR</i></b> ≤ 20.0000%\nNumber of monthly payments <b><i>n</i></b> with 12 ≤ <b><i>n</i></b> ≤ 96",
  "Output": "One line for each test case containing 3 values: monthly payment, final cost, and total interest paid. Each value is\nrounded to 2 decimal places and has a leading $ with the value right-aligned in a field of 9 columns. One space separates the\nfields."
}