{
  "Body": "You and your best friend Rodrigo have decided to travel together. Rodrigo comes from money so you guys have some funds to\ntravel with, however you need to determine where you can go with the amount of money you have, and which of those places\nyou’d be most excited to go to. Rodrigo’s parents would like you guys to learn something from this trip, so they have added\nsome interesting stipulations if you are going to go:\n\n<ul><li>You have unlimited money when it comes to spending money and hotels.</li>\n<li>You will be given a money limit for travelling.</li>\n<li>You are only allowed to take planes from place to place.</li>\n<li>You will always begin in Dallas, but you can end anywhere (don’t worry about the return journey).</li>\n<li>You need to show them a sorted list of the places you can afford to go to, in the order in which you are excited to go.\nThe list will be sorted by the following criteria:\n<ol><li>First sort the list based on the number of attractions, in descending order, then</li>\n<li>Sort by the culinary rating of the city, in descending order, then</li>\n<li>Sort by the price of staying, in ascending order, then</li>\n<li>Sort by the tourist rating of the city, in descending order, then</li>\n<li>Sort the cities alphabetically.</li></ol></li></ul>",
  "Input": "The input will begin with two integers, c and f, denoting the number of cities and flights, respectively, followed by an\ninteger m denoting the amount of money you and Rodrigo have for flights. Each of the following c lines will contain a city\nlisting, consisting of the following values: a string name denoting the name of the city, a decimal value trtg denoting the\ntourist rating of the city, a decimal value price denoting the price to stay in the city, an integer value att denoting the number\nof attractions, and a decimal value crtg denoting the culinary rating of the city, all separated by spaces. After this, the next f\nlines will each contain a flight listing, consisting of 2 strings, a and b, denoting the cities where the flight will go to and from\n(can go in either direction), followed by price, a decimal value denoting the price of the flight. The city of Dallas will always\nbe included in the flights, but not in the listed cities.",
  "Output": "Output a numbered ranked list of the city names that you are most excited to visit, in the format shown in the Sample\noutput section below, with the number of the city in the list first, followed by a colon, followed by a space, followed by the name\nof the city. To clarify: the cities in the list are any cities you can possibly visit on ANY path, not necessarily cities all on the\nsame path. If you can get to Milan and Prague, or Paris, on 2 separate paths, all 3 should be included."
}