{
  "Body": "Svetlana’s favorite activity growing up was the classic board game, Checkers. Checkers is a turn-based game played on an 8 x 8\ngrid between two players, Team Red and Team Black. Each player begins with 12 pieces, staggered on the dark portions of the\nboard. Non-king pieces, typically called \"men\", denoted by a lowercase letter, can move diagonally forward only, one square at a\ntime, onto an empty adjacent dark square. They capture opponent's pieces by jumping over them forward diagonally if there is an\nempty square immediately beyond the jumped piece. As soon as a non-king piece makes it the full distance of the board, the\npiece is transformed into a King, denoted as an uppercase letter, allowing it to move BOTH forward and backward! (Remember,\nnon-king pieces can only move diagonally forward.) Red’s home position will always be top of board with black’s home\nposition at bottom.\n\nThe goal of checkers is to capture all of the opponent’s pieces, without losing all of your own pieces. As soon as one player is\nout of pieces, the game is over.\n\nSvetlana needs your help determining how many unique <b><u>single</u></b> moves each team, Team Red and Team Black, can make in a\ngiven board. Although some rules allow for a double jump, Svetlana is only considering <b>single</b> jumps.\n\nFor example, given the below board state:\n\n<img/>\n\nThe legal moves are as follows:\n\n<img/>",
  "Input": "Input will begin with an integer N, the number of test cases. N is in the range [1,10]. Each of the following N\ntest cases will start with 16 dashes to serve as a divider between each of the boards. Following the dashes will be 8\nrows representing the checkers board. Each valid space will be either a ‘r’, ‘R’, ‘b’, ‘B’, or ‘_’. Where ‘r’ denotes a\nred non-king, ‘R’ denotes a red King, ‘b’ denotes a black non-king, and ‘B’ denotes a black King. The underscore\ndenotes the square is empty. All, individual squares will be separated by a space to simply the reading of the input.",
  "Output": "For each of the test case, you are to output “Test case: #” where # is the current test case. On the\nsubsequent line you are to output “Red valid single moves: RR” where RR denotes the number of valid\nsingle moves available for red to make. On the next line, you are to output “Black valid single moves:\nBB” where BB denotes the number of valid single moves available for black to make. To reiterate, no double jumps\nare allowed."
}