{
  "Body": "You have been trapped in a maze by your arch-nemesis Pavel! He has trapped you in here, and after a certain amount of time he\nwill release millions of venomous snakes into the maze. You need to find out if you can get out of the maze in the time allotted.\nThis maze, however, has a twist. Some of the walls will disappear sometimes. The maze operates on a 4-second cycle, for every\nsecond in this cycle, one type of walls will disappear (more elaboration in the Cycle section). The cycle is in the first second\nwhen you take your first step from the starting point, and the cycle moves forward every time you take a step.",
  "Input": "The first line will contain a single integer n (0 < n < 20) that indicates the number of data sets that follow. Each data set\nwill begin with a line containing 3 integers r, c and s (0 < r, c, s < 1000), denoting the number of rows and columns in the\ntextual representation of the maze we will be given, and the amount of seconds before Pavel unleashes the snakes into the maze,\nrespectively. Each of the following r lines will contain c characters denoting the layout of the maze that you need to escape\nfrom. The maze will be made up of the following characters:\n\n<ul><li># - denotes a wall, this is an impassable object, meaning under no circumstances can it be passed through.</li>\n<li>. - denotes an empty space, which is always passable, and takes one second to cross.</li>\n<li>1 - denotes a wall that disappears in the 1st second of the cycle.</li>\n<li>2 - denotes a wall that disappears in the 2nd second of the cycle.</li>\n<li>3 - denotes a wall that disappears in the 3rd second of the cycle.</li>\n<li>4 - denotes a wall that disappears in the 4th second of the cycle.</li>\n<li>S - denotes the starting point, which is where you are.</li>\n<li>E - denotes the exit of the maze, as soon as you get there you have escaped the maze. (So, if you step onto the finish as\nthe snakes are released, you still escape the maze.)</li></ul>\n\nWhen in the maze, you can only move in the 4 cardinal directions (up, down, left, and right). Each step you take will take one\nsecond, and walls cannot be walked through. If you stop moving for any amount of time, the snakes will be released early. Due\nto this, not all mazes will be solvable, however, backtracking is allowed and expected.\n\n<b>Cycle:</b> The cycle of the maze is rather simple, and it lasts 4 seconds, or steps, as every second you will take one step. A wall\nwill only disappear for one second, or step of the cycle. You begin in the first step of the cycle, then you take a step, now you\nare in the second step of the cycle, and so on. This matters because of the maze layout, certain paths will only be available if you\ntake them in the correct order. In other words, the number of the wall tells us in which step of the cycle it will be gone. For\nexample, you are in step 3 of the cycle, you are standing in open space. The wall next to you is a 3, so it is gone for now,\nhowever, you can't step on it, as it will reappear when you do, because you will enter the 4th step of the cycle. If the wall was a\n4, it would be there when you’re next to it, but when you take a step and go into the 4th step of the cycle, the wall disappears and\nyou can pass through.",
  "Output": "There will be two things output by each test case. The first, will be the number of steps, followed by the string “\nsteps.”. If it is impossible to escape the maze before the snakes are released, instead of the number of steps, print out the\nstring “Aw, rats!”. The second output, on its own line, following the first will be the string “I have had enough of\nthese snakes.”, if you escape the maze in time. If you do not escape in time, output the second string “I'll see you\nin the Gulag Pavel.”."
}