{
  "Body": "Patrick has been researching mathematical sequences for a special project and stumbled upon one called the “look-and-say”\nsequence. It is rather unique because it is not generated from an infinite application of a mathematical formula. Instead, the\nsequence is extended as if a human reader was describing the current number as a count of occurrences of each subsequence\ncontaining one specific digit. The starting number, like many numerical sequences is 1. If you were asked to describe the\ncurrent number it would be one count of the digit one or “one one” which becomes the next number in the sequence 11. The\nnew number contains “two ones” producing 21. Continuing the pattern, “one two, one one” produces 1211 then “one one, one\ntwo, two ones” produces 111221. This sequence is shown below along with several more numbers in the sequence.\n\n\t1, 11, 21, 1211, 111221 as described above and sequence continues as follows:\n\t312211 is “one three, one one, two twos, two ones”\n\t13112221 is “one one, one three, two ones, three twos, one one”\n\t1113213211 is “three ones, one three, one two, one one, one three one two, two ones”\n\t31131211131221 etc.\n\n\tHow about starting with an arbitrary sequence of digits?\n\n\t7440888 is “one seven, two fours, one zero, three eights”\n\t17241038 is “one one, one seven, one two, one four, one one, one zero, one three, one eight”\n\t1117121411101318 etc.\n\nCan you help Patrick create a program to generated such sequences given an initial starting number?",
  "Input": "An unknown number of lines, greater than 1 and no more than 20. Each line contains 2 integers separated by a single\nspace: N, the first number of a sequence with 0 ≤ N ≤ 999999999999999 and P, the position of the desired number in the\nsequence with 1 ≤ P ≤ 25. N will not contain a sequence of any single digit that is longer than 9.",
  "Output": "For each test case, display one line containing the P<sup>th</sup> number of the sequence. Length of resulting number will not\nexceed 2000 digits."
}