{
  "Body": "Cole is revisiting his old favorite game, <i>Factorio</i>, now with a new DLC. A core mechanic of the game is automation — namely,\nanything that can be crafted can also be automated using <i>Assembling Machines</i>. These machines take inputs, process recipes,\nand produce outputs, which can then be used in more advanced recipes.\n<img/>\n\nPreviously, Cole relied on online guides to determine the correct input-output ratios. Now, he’s much smarter, and wants to\ncalculate them himself. Given a set of crafting recipes and a target production rate for a specific item, determine how many\nassembling machines are needed for each input.",
  "Input": "The first line will consist of two space-separated integers <i>R</i> and <i>Q</i>, (1 ≤ <i>R</i> ≤ 300, 1 ≤ <i>Q</i> ≤ 10<sup>4</sup>), denoting the number\nof crafting recipes and queries. The next <i>R</i> lines will all take the same format:\n\n<img/>\n\nWhere…\n<li><ul><i>S</i> is the item name.\n</li><li><i>p</i> is the number of items produced per crafting cycle.\n</li><li><i>t</i> is the time taken per crafting cycle.\n</li><li><i>n</i> is the number of inputs required.\n</li><li>Each pair (<i>i<sub>k</sub></i>, <i>q<sub>k</sub></i>) represents an input item and its required quantity.\n</li></ul>\nRaw ingredients (available infinitely, but take time to harvest) have <i>n</i> = 0, <i>p</i> = 1, and <i>t</i> = 1, will be written as:\n\n<img/>\n\nEvery input item in a recipe is guaranteed to have a corresponding entry among the <i>R</i> recipes. Moreover, there are no cycles in\nthe dependencies, and there will be <i>at least</i> one crafting recipe that is a raw ingredient.\n\nThe next <i>Q</i> lines contain queries in the format \"<i>A</i>, <i>r</i>\" where <i>A</i> is the item to be produced, and <i>r</i> (10<sup>-4</sup> < <i>r</i> ≤ 10<sup>6</sup>) is the desired\noutput rate per second (up to 5 decimal places). <i>A</i> is guaranteed to be in the recipes.",
  "Output": "For each of Cole’s <i>Q</i> queries…<ol><li>Print \"<i>A</i> (<i>r</i>):”, where <i>r</i> is formatted to 5 decimal places.</li><li>For each required input (<i>i<sub>k</sub></i>), print a tab followed by \"<i>i<sub>k</sub></i>: <i>a<sub>k</sub></i>\", where <i>a<sub>k</sub></i> is the number of assembling machines needed,\nrounded to the nearest whole number. List inputs in lexicographical order.</li></ol>\nNote that we are assuming that <i>r</i> is an average rate that needs to be met over an effectively infinite amount of time and need not\nbe satisfied at rate <i>r</i> immediately.\n\n<b>Hint:</b> To avoid floating-point precision errors when rounding, subtract a small value ε = 10<sup>-6</sup> before rounding."
}