{
  "Body": "Emerson has designed a new video game for you to test. It’s a maze solving game, with a portal gun. You need to determine the\nshortest path to escape each level of the maze, if you use the portal gun optimally. The portal gun will have a specified number\nof charges, and each charge will make a portal from your current position, to any position that is 2 spaces away, or 1 diagonally\n(2 up, 1 up 1 left, 2 left, 1 left 1 down, 2 down, 1 down 1 right, 2 right, 1 right 1 up), and using a portal will not count as a step.\nWhen not using a portal, you can only move in the 4 cardinal directions (up, down, left, right). The maze will be made up of\nempty paths, walls, and land-sharks which you cannot get within 2 spaces in front of whichever direction they are facing\n(including when entering or exiting a portal). The start and end points of the maze will never be within the restricted area of a\nland shark.",
  "Input": "The input will begin with an integer, n (0 < n <= 1000), denoting the number of test cases to follow. Each test case\nwill consist of three integers, separated by a space, r, c, and p (0 < r,c <= 250 0 < p < 13), denoting the number of\nrows and columns in the maze level, and the number of “charges” the portal gun has. The following r lines will each contain c\ncharacters denoting the layout of the maze level, which will be made up of the following:<ul><li>. – Denotes an empty space in the level, where you can walk.</li><li># – Denotes a wall in the level, an impassable object.</li><li>S – Denotes the starting point for the level.</li><li>E – Denotes the end point of the level.</li><li>< > ^ v – Any of the preceding characters will denote a land shark, with the direction their “mouth” is pointed being\nthe direction they are facing (< is right, > is left, ^ is down, v is up). Land sharks do not move throughout the maze,\nthey are rather lazy.</li></ul>",
  "Output": "For each test case, output the minimum amount of steps required to get from the starting point to the ending point of\nthe maze. If this is not possible, output -1."
}