{
  "Body": "You’ve been volunteering at the local animal shelter in your free time, in particular, you’ve been put in charge of the cats. Your\nboss, Mike, has asked you to put in the order for cat food this month. When you asked him how that’s typically done he said that\nthe shelter just orders some massive amount of each food, and rotates through them every day. You, however, have noticed that\nsome cats like certain flavors of cat food and won’t even eat others. You’ve gone through the liberty of finding out which\nflavors the cats like to eat when they eat, and how much they eat at a time. You’ve asked your boss if you can order based on\nthis data and he says sure but only if you spend as little money as possible.",
  "Input": "The first input line will contain a single value N (1 ≤ N ≤ 100) denoting the number of test cases to follow. Each test\ncase will start with a value M (1 ≤ M ≤ 1000) that denotes the number of cat feedings that follow. The next M lines will be in\nthe form of T, A, and B (1 ≤ A ≤ 1000). T is the hour, minute, and second that this cat will be fed. A is the amount of food in\nounces that the cat eats at time T. B is the brand of food that the cat is fed at time T. Each test case will end by enumerating all\nbrands B required to feed all cats. Each brand will have an input line that starts with the brand name and then a list of\npurchasable cans of food. The list of purchasable food will take the form of C:W:P where C (1 ≤ C ≤ 100) is the number of\ncans in this package, W (1 ≤ W ≤ 1000) is the weight of each can of food in ounces, and P is the price of this package rounded\nto the nearest cent.\n\nW is guaranteed to be an integer, and every brand will at least have single one-ounce cans for sale.",
  "Output": "Output “Total cost to feed all cats: ” followed by the least amount of money you need to spend to feed\nall the cats their desired foods, rounded to the nearest cent with commas where required.\n\nNote that you cannot have less food than required to feed all cats, but you may have extra."
}