{
  "Body": "Saim is a new kid in your class and you’ve decided you’re going to be his friend. He really likes the video game Mortal\nKombat. You have built your own version of this game called Kortal Mombat to play with him. You need to write a program to\nread in the commands given and determine who wins each game. The game is similar to most fighting games, where two\ncharacters face off, doing different actions until one character runs out of health. You will go first, doing one action, then Saim\nwill go (you get advantage because Saim is an experienced player). Kortal Mombat has 4 different character options who do\ndifferent damage and healing, and each character will have 4 possible actions they can take, as follows:\n<ul><li>RT – This is the character’s primary attack, it will do a certain amount of damage, depending on the character.</li><li>LT – This is the block, each character has the same block. This will negate the damage of the next attack by the\nopponent, but will do nothing if the next move by the opponent is not an attack.</li><li>RB – This will be a secondary attack, typically does more damage, but you will take double damage from the\nopponent’s next attack.</li><li>LB – This will be a heal, which will add a small amount of health back to your character.</li></ul>\nThe 4 characters are as follows:\n<img/>",
  "Input": "The input will begin with an integer, n (0 < n <= 1000), denoting the number of test cases to follow. Each test case\nwill begin with a line containing 2 chars denoting the characters chosen by you and Saim respectively, followed by an integer m\ndenoting the number of commands each of you input. The following line will contain m commands (from the 4 above actions\nyou can take), denoting the actions you took in the game. The line after will contain the same information for Saim. If one\ncharacter’s health goes to 0 before the end of the line, they lose, and you should ignore the rest of the line. When m=0, there will\nbe no following input lines for that case.",
  "Output": "For each test case, output the name of the winner, either “You” or “Saim”. If you get to the end of both player’s\nactions and neither has won, output “Draw”. After all test cases, output your record, in the format W-D-L, where W is the\nnumber of your wins, D is the number of your draws, and L is the number of your losses."
}