{
  "Body": "Veerasamy has recently found himself confined to two dimensions and is very confused by this planar projection. He has\nseveral questions related to his recent transformation, including why he is now only being represented as a single point, but he is\nreally curious in knowing whether he is still inside the “room” he was in back when he was in three-dimensional space. Help\nVeerasamy among his confusion determine if he is still contained within the, now two-dimensional, representation of the room\nhe was in.\n<img/>",
  "Input": "The first line of input will consist of a single integer, <i>T</i> (1 ≤ <i>T</i> ≤ 10<sup>3</sup>), denoting the number of testcases to follow. Each\ntestcase will begin with an integer <i>n</i> (3 ≤ <i>n</i> ≤ 10<sup>3</sup>) denoting the number of points that comprise the simple polygon <i>P</i> followed\nby a space and either the word \"Convex\" or \"Concave\" indicating whether the polygon is convex or concave. The next <i>n</i> +\n1 lines will consist of two space-separated floating-point numbers <i>x<sub>i</sub></i> and <i>y<sub>i</sub></i>, (−10<sup>4</sup> ≤ <i>x<sub>i</sub></i>, <i>y<sub>i</sub></i> ≤ 10<sup>4</sup>) denoting the <i>x</i>- and <i>y</i>-\ncoordinate of the <i>i</i><sup>th</sup> point (<i>p<sub>i</sub></i>), the last of which denotes the point <i>q</i> (Veerasamy’s location), which is not a part of the polygon.\nThe polygon is formed by creating an edge between <i>p<sub>i</sub></i> and <i>p</i><sub>(<i>i</i>+1) mod <i>n</i></sub> for all 1 ≤ <i>i</i> ≤ <i>n</i>. It should be noted that the points of <i>P</i>\nwill be listed starting from the left-most point, proceeding along the incident edge that is clockwise from the first point,\ncontinuing along the unvisited incident edge of <i>p<sub>i</sub></i>, until <i>p<sub>n</sub></i> (which has an edge with <i>p</i><sub>1</sub>). Lastly, general position can be assumed\n(no two points share the same <i>x</i>-coordinate / <i>y</i>-coordinate; no three points are collinear).",
  "Output": "For each of Veerasamy’s <i>T</i> situations, on its own line, either print \"Safe and sound.\" if Veerasamy is still in his\nroom (inside of polygon <i>P</i>), or print \"Dreaded dimensional downgrade!\" if he no longer is in his room (outside of\npolygon <i>P</i>)."
}