{
  "Body": "Bodhi’s older sister is studying finance in college and was showing Bodhi the concept of financial compounding. It is a type of\ninvestment, like a savings account, where the profit earned is put right back into that same investment. The result is you earn\neven more profit from the previous profit in addition to profit from the original investment. He thought that sounded rather\ninteresting but wants to see the concept in action, meaning, <b>show me the money!</b>\n\nWith <b>PV</b> as the present value or a fixed amount that is invested only one time and <b>FV</b> as the future value after <b>n</b> compounding\nperiods (addressed below), the simple compounding formula is:\n\n<img/>\n\nThe compounding period could be days, months, quarters, years, or some other fixed period of time and defines when interest\nprofit is calculated and put back into the account. It can get confusing comparing options so most investments state an annual\npercentage rate (APR) which is the result of the periodic compounding after 1-year.\n\nFor the formula above, <b>rate</b> is the APR divided by the number of compounding periods in a year. It is a periodic rate that\nmatches the compounding period. To obtain a monthly rate, simply divide the APR by 12 monthly periods in a year and a\nquarterly or 3-month rate would be APR divided by 4. In addition, the standard formula requires the percentage rates be\nconverted into their equivalent decimal form so a 5.25% rate becomes 0.0525.\n\nThe total profit after <b>n</b> periods would simply be the difference between the future value (<b>FV</b>) which is the end of the investment\nand the original investment (<b>PV</b>) which is the initial investment.",
  "Input": "First line will contain an integer T with 1 ≤ T ≤ 10, the number of test cases. Each test case will consist of one set of\nwhitespace-separated investment parameters on a single line. The investment parameters are <b>PV</b>, a dollar and cents amount no\nlarger than $1,000,000 followed by an APR which is a percentage greater than 0.00% and will not exceed 25.00% (which would\nbe a dream rate!). The final pieces of data for a single test case are the number of periods in a year in the range [1, 366] and <b>n</b>,\nthe number of periods to compound which will not exceed 100.",
  "Output": "Each test case will produce 1 line of output containing the computed <b>FV</b> which is a dollar and cents amount and the\ntotal profit, neither of which will not exceed $3,000,000.00. Format both values with a leading dollar sign ($) and round to 2\ndecimal places of accuracy and separated by a single space as shown in the sample output."
}