{
  "Body": "You and Claudius are lost in the woods! Quick, write a program on your handy dandy pocket computer to find the shortest path\nout of the woods! You have a map of the woods, with different geological features and the parking lot marked, and you need to\ndetermine if you will escape from the woods before the Forest Rangers come to find you. This map is magic, and will also\ncontain the locations of certain dangerous animals and areas to avoid. The map will be made up of the following characters:\n● 'M' – denotes the location of a mountainous region on the map, these areas can be crossed at a rate of 3 hours per\nspace.\n● 'T' – denotes the location of a forested area of the map, these areas can be crossed at a rate of 2 hours per space.\n● 'R' – denotes the location of a rock/boulder, these areas are impassable.\n● 'Q' – denotes the location of quicksand, these areas are impassable, unless they are directly adjacent (up, down, left,\nright) to a forested area, in which case you can cross at a rate of 3 hours per space, as you can use the trees to climb out\nif you get stuck.\n● 'V' – denotes the location of a river, these areas are impassable.\n● 'A' – denotes the location of an alligator, which you must stay at least one block away from (you cannot be adjacent in\nany direction including diagonals).\n● '.' – denotes a path/trail/dirt patch which can be passed at a rate of 1 space per hour.\n● 'S' – denotes your starting point on the map.\n● 'E' – denotes the parking lot, which is the end point of your journey.\n● 'B' – denotes the location of a bear, which you must be at least 2 spaces away from at all times, including diagonals.\nYou can only move in the 4 cardinal directions (up, down, left, right).",
  "Input": "The input will begin with an integer, n (0 < n <= 1000), denoting the number of test cases to follow. Each test case\nwill begin with 3 space-separated integers, r, c, and h, denoting the number of rows and columns in the map of the woods, and\nthe number of hours you have until the Forest Rangers come looking for you. The following r lines will each contain c\ncharacters denoting the map of the woods.",
  "Output": "If you make it to the parking lot in h or less hours, output the string \"Free at last, Free at last. \",\nfollowed by the number of hours you had left until the Forest Rangers will look for you (could be 0), followed by the string \"\nhour(s) to spare.\". If you do not make it to the parking lot in time, output the string \"Smokey the Bear is en\nroute.\"."
}