{
  "Body": "Hannah is practicing her programming skills for the upcoming UIL Computer Science contest season. She heard that the State\ncontest experience is very challenging and wants to be prepared. Her coach explained how the overall state scores are grouped\nby classifications (1A, 2A, 3A, 4A, 5A, 6A) and are a combination of both programming and the written test. Each contest team\nconsists of 3 students that take the written test with 40 questions which has a max score of 240 but could be negative when\nstudents answer too many questions incorrectly; there is no penalty for unanswered questions. The max team score for the\nwritten test is 720, or 3 scores of 240 points. The programming component of the contest consists of 12 problems worth a max\nof 60 points each but submissions that are not correct reduces the problem’s max score by 5 points for each bad submission. The\nteam programming score is another 720 points, or 12 programs of 60 points. The overall team score is simply the sum of the\nwritten and programming scores.\n\nThe following table is a sample of the programming data.\n\n<img/>\n\nThe following table is a sample of the written test data.\n\n<img/>\n\nHannah has accepted a challenge of processing the raw scores to determine the top 3 teams in each classification. It is just\nsumming the scores and finding the 3 top overall team scores in each classification. Ties are not common so we will ignore that\npossibility for this program. Can you handle her challenge?",
  "Input": "First line will contain an integer <b>T<\b> with 1 ≤ <b>T<\b> ≤ 10, the number of test cases. Each test case will start with a positive\ninteger <b>N<\b> which is the total number of teams. The <b>N<\b> following lines will each contain a school name with no spaces, a\nclassification as shown above, and 12 integers in the range [0,60], all items whitespace-separated. Those lines are then followed\nby <b>N<\b> more lines each containing a school name with no spaces and 3 integers in the range [−80,240], all whitespace -separated.\nTeam names will be in the same order for both sets of scores but classification levels may vary in order. There is guaranteed to\nbe 1 or more teams for each classification and they must have 12 program scores and 3 written exam scores.",
  "Output": "Each test case will produce a list of the team names and scores in descending order for each classification, organized\nfrom 1A to 6A. Label and format the results as shown in the sample below. Display a single line following each test case\ncontaining 15 equal signs “===============”."
}