{
  "Body": "While studying infinite sums in her Calculus class, Jennifer was introduced to the well-known proof which shows that 0.999$ =\n1. Being well-versed in the world of mathematical bases, Jennifer’s Calculus teacher showed them a similar proof to show what\nthis would be equivalent to in a base five numbering system.\n\nThe idea is that if you take a square with side length of 1, and break it down into 25 congruent squares, you can form four\nidentical sections, each with 5 of the congruent squares. This would mean that each of those sections comprise 1/5<sup>th</sup> of the area\nof the whole square. Doing so would also leave you with 5 remaining squares. If you were to take 4 of the remaining 5 squares,\nyou would then have four new sections each comprising 1/25<sup>th</sup> of the area of the whole square. Then, take the last remaining\nsquare, and perform the entire process again on that square infinitely.\n\n<img/>\n\nThis means that 4(1/5) + 4(1/25) + ⋯ + 4(1/5)<sup>n</sup> = 1. In other words, for a base five numbering system, (0.44̅4)<sub>5</sub> = 1. However,\nJennifer was interested to see whether or not this property of infinite sums generalized to different bases. While investigating\nthis, Jennifer discovered a generalized formula which showed that for all |<i>x</i>| ≥ 1, where <i>x</i> is equivalent to the base, that…\n\n<img/>\n\nDiscovering this generalized formula got Jennifer interested in the notion of non-integer bases. Specifically, given the inverse of\nan arbitrary base, help Jennifer determine the most simplified number of sections that will be required at each stage in the\ninfinite sum process.",
  "Input": "The first line will be a single integer <i>T</i> (1 ≤ <i>T</i> ≤ 100) denoting the number of test cases to follow. The next <i>T</i> lines will\nconsist of 2 space-seperated integers, <i>n</i> and <i>d</i> (1 ≤ <i>n</i>, <i>d</i> ≤ 2<sup>31</sup> − 1), denoting the numerator and the denominator of the inverse\nof the current base. It is guaranteed that the value of |<i>d</i>/<i>n</i>| > 1",
  "Output": "For each of the <i>T</i> test cases, output two space-separated integers, <i>n<sub>s</sub></i> and <i>d<sub>s</sub></i>, denoting the simplified numerator and\ndenominator of the number of sections that are required at each stage in the infinite sum process."
}