{
  "Body": "Veda is a successful entrepreneur and has made a name for herself by owning a company which specializes in creating custommade signs. Like most custom-made sign businesses, Veda’s company, Ingenious Insignia™, prices her signs based off of the\namount of ink, dye, or vinyl that would be required to create said sign. As a result, she generates her prices on a per-letter basis,\nwhere each letter occurring on the sign costs a certain amount. However, being the smart businesswoman that she is, Veda\nknows that certain letters require more materials compared to others. As a result, Veda’s pricing is different depending on the\nletter in question.\n\nWanting to be able to ensure that Veda maintains a competitive advantage over her competitors, she wants to figure out whether\nor not a certain letter-to-price ordering would make her business favorable. Help Veda write a program that, given a list of\nletter-to-price pairings, as well as different slogans for signs from potential future customers, returns the cost for each test sign.",
  "Input": "The first line of input will consist of a single integer <i>n</i> (1 ≤ <i>n</i> ≤ 26) denoting the number of unique letter-to-price\ngroups. The next <i>n</i> lines will each consist of a comma-separated list of letters, followed by a colon, followed by a price <i>p</i> (0 <\n<i>p</i> ≤ 10). This denotes that each letter contained in the comma-separated list costs <i>p</i> dollars per letter. Valid letters consist of\nonly the standard 26 capitalized English letters. All punctuation, spaces, and other special characters are considered free. It is\nalso guaranteed that each letter appears exactly once among the <i>n</i> comma-separated lists.\n\nThe next line will consist of a single integer <i>m</i> (1 ≤ <i>m</i> ≤ 50) denoting the number of slogans that Veda wishes to calculate the\nprice for. The next <i>m</i> lines will each consist of a single slogan, which will strictly consist of capitalized English letters,\nwhitespace, and special characters.",
  "Output": "For each slogan that Veda wishes to test, in the order that it appears in the input, on its own line, print out the cost <i>P</i>\nthat it would take to print said slogan using the letter-to-price groupings described in the input. This dollar amount should be\nprepended with a dollar sign (‘$’) and should be expressed to two decimal values (rounded to the nearest cent)."
}