{
  "Body": "Kumar is just fascinated by repeating decimals. Repeating decimals are rational numbers whose decimal representation\neventually become periodic. In other words, the same sequence of digits repeats indefinitely. For example, the fraction 1⁄3 is\nrepresented as .333333333... = .<u>3</u>\n\nRepeating decimals are not limited to a single digit, nor does the repeating sequence have to begin directly following the decimal\npoint. For example, the fraction 60611/499950 is represented by . 12123412341234. . . = .<u>121234</u>\n\nIn this case, the repeating sequence is 1234, but does not start until the third decimal place after the decimal point.\n\nAt present, there is no single universally accepted notation or phrasing for repeating decimals. However, this hasn’t stopped\nKumar from attempting to write code that will be able to read in a decimal number, either repeating, or non-repeating, and output\nthe corresponding fractional number. For the purposes of Kumar’s proposed code, input will consist of a decimal number in\nrange of [0,1). The decimal number is assumed to be not repeating, unless the number is followed by an ellipsis (...). For cases\nwhere an ellipsis is present, the repeating sequence will be repeated exactly three times. Your job is to help Kumar write source\ncode that will read in the decimal number and output the corresponding, reduced fraction. Think you’re up to the task?",
  "Input": "The first line will contain a single integer n that indicates the number of data sets that follow with n guaranteed to be in\nrange [1,20]. Each data set will consist of a single decimal number d, where d will be in range the [0.0, 1.0). The number of\ndecimal places after the decimal point will not exceed 14. Input cases denoting a repeating decimal will be followed by an\nellipsis (...). For cases with an ellipsis, the repeating portion will be guaranteed to repeat three times.",
  "Output": "For each data set, you are to output the original decimal number followed by “ is equivalent to ” then the\nreduced fraction the decimal represents. For a decimal number of .0, you are to output “0/1”."
}