{
  "Body": "You have hired a DJ for your annual “<b>END OF THE YEAR BIG TIME BIG BOY BIRTHDAY BASH</b>”, for your friend\nKevin. The dj’s name is Vijay, but he is having some technical difficulties. It seems he left all of his super important dj CDs in\nyour friendly neighborhood 3D space with no gravity. You need to quickly retrieve the CDs and escape before your show starts.",
  "Input": "The first line will contain an integer, n, denoting the number of test cases in the data. The first line of each test case will\ncontain 5 integers, h, r, c, o, and s, denoting the # of levels in the maze (0 < h < 20), the # of rows in the maze (0 < r < 20), the\n# of columns in the maze (0 < c < 20), the # of CDs located within the maze (0 < o < 10), and the amount of time, in seconds,\nthat you have to get all the CDs (0 <= s <= 25000). The next r lines will contain c characters denoting the layout of the maze.\nThese r lines denote the first layer of the maze, while the next r denote the second layer of the maze, and so on. These\ncharacters can be any of the following:\n\n<ul><li>'#' – Denotes a wall.</li>\n<li>'.' – Denotes an empty space.</li>\n<li>'O' – Denotes the location of a CD within the maze.</li>\n<li>'S' – Denotes the starting location for you.</li>\n<li>'E' – Denotes the exit of the maze (may be more than one).</li></ul>\n\nIn terms of movement within the maze, every step you take in any direction will take one second. You can move in any of the\nmain 6 directions, but only one direction and step at a time, so you can only move up, down, forward, backward, right, and left.\nNote: backtracking IS allowed.",
  "Output": "For each data set, if you cannot successfully navigate your way out of the maze within the time limit, output the string\n“None shall pass.”. If you can successfully get out of the maze, output the string “# of steps achieved: ”,\nfollowed by the number of steps you took to escape the maze.\n\nNote: if you have 18 seconds to escape the maze, and on your 18th step you get to the exit, you made it!"
}