{
  "Body": "You are the newest member of the basketball team at your school. Professional player Howard Dwight is coming to help coach\nand take you guys to the next level. One of the big things he wants to do is to start incorporating “Advanced Statistics” into your\nschemes as a team. The first thing he’s going to do is sort the players based on their true shooting percentage, and if two players\nhave the same true shooting, then sort by their assist to turnover ratio. True shooting percentage can be calculated using the\nfollowing formula: (variables defined in input section below)\n\n<img/>\n\nAssist to Turnover ratio can be calculated simply by dividing the number of assists by the number of turnovers.\nYou have been assigned the job of sorting the players, and choosing the best player at each position to create the ideal starting\nlineup. Remember to sort by players with the largest true shooting first, and then if any are equal sort by players with the higher\nassist to turnover ratio (APG / TPG).",
  "Input": "The input will begin with an integer, n (0 < n <= 1000), denoting the number of players to follow. Each player will\nappear on a single line with the following fields in the order listed below, all separated by spaces:<ul><li>Number – The number on a player’s jersey, an integer value.\n</li><li>Name – The player’s last name, a string.\n</li><li>Position – A string denoting which position this player plays.\no Will be PG, SG, SF, PF, or C\n</li><li>PTS – Points per game, a floating point value (maximum 3 decimal places).\n</li><li>APG – Assists per game, a floating point value (maximum 3 decimal places).\n</li><li>FGA – Field goals attempted per game, a floating point value (maximum 3 decimal places).\n</li><li>FTA – Field goals attempted per game, a floating point value (maximum 3 decimal places).\n</li><li>TPG – Turnovers per game, a floating point value (maximum 3 decimal places).</li></ul>",
  "Output": " Output the best player to be in the starting lineup for each position, in the order PG, SG, SF, PF, C. Each position\nshould be listed on its own line, followed by a colon and a space, followed by the number of the player, a period, a space, and the\nlast name of the player. There is always guaranteed to be at least one player for each position, and no players will have equal\ntrue shooting AND assist to turnover ratio."
}