{
  "Body": "It’s February, which is when Texas gets the most snow, which is no different for Nicolas on this cold morning. Thankfully,\nNicolas lives within walking distance of his school; however, unfortunately for him, the roads and sidewalks are rather icy. This\nmakes it so that, when Nicolas starts walking in a certain direction, he is forced to continue moving in that direction until he\nbumps into something stationary. Thankfully for him, Nicolas is rather tough and is not concerned with getting hurt from\nrunning into said objects; however, he is concerned with minimizing the number of times he bonks into something, even if it\nmeans walking (really sliding on the ice) a little further. Help Nicolas in planning the path that minimizes the number of times\nhe needs to run into a stationary object on his way to school.",
  "Input": "The first line of input will consist of a single integer <i>n</li>, 1 ≤ <i>n</li> ≤ 10<sup>3</sup>\n, denoting the number of different places that\nNicolas needs to determine a route to. The next <i>n</li> test cases will each consist of a single line denoting two space separated\nintegers, 𝑟 and 𝑐, 2 ≤ 𝑟, 𝑐 ≤ 2 ⋅ 102\n, denoting the number of rows and columns, respectively, in the map that Nicolas is basing\nhis routes off of. The next 𝑟 lines will consist of 𝑐 characters, each character will be among one of the following:\n<ul><li>'.' : Denotes a walkable space that Nicolas can slide on.\n</li><li>'#' : Denotes a stationary object that Nicolas can bump into.\n</li><li>'S' : Denotes Nicolas’ starting position. There will be a single spot labeled with an 'S'.\n</li><li>'E' : Denotes the location that Nicolas is attempting to reach. There will be a single spot labeled with an 'E'.</li></ul>",
  "Output": "For each of Nicolas’ <i>n</li> routes, print out a string denoting the series of directions that Nicolas should move in to\nminimize the number of stationary objects that he has to run into. This string will consist of the characters 'N', 'S', 'E', and 'W'\ndenoting North, South, East, and West. If there are multiple such paths that minimize this, then print out the one that is\nlexicographically smallest. It is also guaranteed that there will be some path from where Nicolas is starting and where he intends\nto end at. You may also assume that there is an understood border of stationary objects on the spaces outside of the map\nprovided to you."
}