{
  "Body": "You and Bart have been experimenting with quantum physics lately, and have learned how to make one way portals. Now Bart\nhas devised a test for your portals. He has designed a maze of sorts, with these portals inside, and your job is to navigate through\nthe maze and find the shortest path to escape. He has also coincidentally created a black hole within the maze, which you need\nto avoid. You will be given a map of the maze, and it will be made up of the following characters:\n\n<ul><li>'$' – This character denotes the starting point of the maze, where you will begin your journey.</li><li>'^' – This character denotes the exit from the maze, where you will end your journey.</li><li>'#' – This character denotes a wall, an area that is permanently impassable.</li><li>'.' – This character denotes an open space, which is passable at a rate of 1 space per second.</li><li>'[A-Z]' – These characters denote the entrance to a portal. When you enter a portal, it takes a certain amount of\ntime, then you are at the exit block (the amount of time is equal to the letter’s position in the alphabet (a = 1, b = 2, and\nso on)).</li><li>'[a-z]' – These characters denote the exit from a portal. When you enter a portal, it takes a certain amount of time,\nthen you are at the exit block (the amount of time is equal to the letter’s position in the alphabet (a = 1, b = 2, and so\non)).</li><li>'@' – This character denotes the black hole, there will only be one of these per map, and the black hole itself is always\nimpassable. The black hole works as follows:<ul><li>At the beginning of the test, the radius of effect of the black hole is 1.</li><li>Every 3 seconds, the radius will expand by 1.</li><li>The radius of the black hole extends in all directions, including diagonals (up, down, left, right, up-right, upleft, down-right, down-left).</li><li>If you are in the outside 2 blocks (outer radius) of the black hole’s radius, your movement speed will be cut in\nhalf.</li><li>If you are inside the radius of the black hole, and not in the outside 2 blocks of the radius, you cannot move\n(these blocks are impassable.).</li></ul></ul>\n\nYou can only move in the 4 cardinal directions (up, down, left, right), and every step takes one second, unless you are in the\nradius of the black hole. If the spot you are in comes into the radius as you leave it, you are unaffected. For every portal within\nthe maze, there will only be one entrance and exit.",
  "Input": "The input will begin with an integer, n (0 < n <= 1000), denoting the number of test cases to follow. Each test case\nwill begin with 3 space-separated integers, r and c, denoting the number of rows and columns in the maze. Each of the\nfollowing r lines will each contain c character denoting the maze.",
  "Output": "If it is possible to reach the exit, output the string \"Exit is short for exciting.\", followed by a space and\nthe number of steps it took to reach it. If it is not possible to reach the exit, output \"Tell Matthew Mcconaughey I\nsaid hi.\"."
}