{
  "Body": "Jason’s sister was working with 2-dimension arrays for her college math homework. She explained that arrays are called\nmatrices in math and she was performing matrix multiplication. She explained the following example:\n\nStart with two matrices (2-dimension arrays): matrix <b>A</b> with <b>n</b> rows and <b>m</b> columns and matrix <b>B</b> with <b>m</b> rows and <b>p</b>\ncolumns. The number of columns <b>m</b> in <b>A</b> must equal the number of rows <b>m</b> in <b>B</b>.  Their product <b>C = AB</b> is <b>A</b> matrix <b>C</b> with <b>n</b>\nrows and <b>p</b> columns. Position <b>(i,j)<b> in the result matrix <b>C</b> is the sum of <b>m</b> products, the elements in row <b>i</b> of <b>A</b> multiplied\nby the elements in column <b>j</b> of <b>B</b>.\n\n<img/>\n\n<img/>\n\nJason realizes that is a lot of work for even a small example and decides to write a program to help his sister check her\ncalculations.",
  "Input": "First line of data file contains the number of data sets which is in range [2,10]. Each data set starts with a line of four\nwhitespace-separated integers: the number of rows <b>r</b><sub>1</sub> and columns <b>c</b><sub>1</sub> in the first matrix and the number of rows <b>r</b><sub>2</sub> and\ncolumns <b>c</b><sub>2</sub> in the second matrix. That line will be followed by <b>r</b><sub>1</sub> lines, each contains values for <b>c</b><sub>1</sub> columns, and then <b>r</b><sub>2</sub> lines,\neach contains values for <b>c</b><sub>2</sub> columns. Whitespace separates all values with matrix content values in range [-100,100]. Minimum\nmatrix size is 2 × 2 and maximum matrix size is 10 × 10.",
  "Output": "For each data set, display a line that starts with the data set number followed by a colon. If matrix sizes are compatible\n(<b>c</b><sub>1</sub> = <b>r</b><sub>2</sub>) display, after the colon, the number of rows and columns of the result matrix separated by a comma. If not compatible,\ndisplay the message “<b>MATRIX SIZES NOT COMPATIBLE</b>” after the colon with no extra spacing. When they are compatible,\ndisplay one line for each row of the result matrix with the column values displayed right aligned in fields exactly 7 characters\nwide and no additional spacing. Generated values are guaranteed to fit in columns. After each data set, output a line containing\nexactly 15 carats “<b>^^^^^^^^^^^^^^^</b>”."
}