{
  "Body": "Max is working on planning a Game Night for him and his friends and has worked out all of the details for the entire night\nexcept for one thing: the games! Max, in an attempt to ensure that his friends all have the best time possible during their time\ntogether, has already sent out a survey to his friends and received data on which games his friends enjoy the most, and has\naveraged the score for each game. Max is interested in selecting a set of games which will maximize the enjoyment experienced\nby his different friends. However, seeing how no one in the groups enjoys only playing a portion of a game, each game selected\nfor the night must be completed in their entirety. However, the group is able to play any given game as many times as they\nwould like, so long as each time they play it, they have enough time to play it to its entirety. Help Max in determining which\ngames he should select for the night given a total amount of time available for the night, as well as a list of games which each\nhave a perceived enjoyment and required playing time.",
  "Input": "The first line of input will consist of a single integer <i>n</i> (1 ≤ <i>n</i> ≤ 50) denoting the number of testcases to follow. The\nnext <i>n</i> testcases will consist of three lines. The first line will consist of two space-separated integers. The first of these integers\nis <i>m</i> (1 ≤ <i>m</i> ≤ 100), denoting the number of games that are to follow, labeled game 1 through game <i>m</i>. The second of these\nintegers is <i>T</i> (0 ≤ <i>T</i> ≤ 1440), denoting the total amount of time that the Game Night will run for. The next line will consist of a\nstring of <i>m</i> space-separated integers denoting the duration (1 ≤ <i>t<sub>i</sub></i> ≤ 500) of the <i>m</i> games. The next line will consist of a single\nof <i>m</i> space-separated floating-point values (expressed to two decimal places) denoting the perceived enjoyment value (0 ≤ <i>v<sub>i</sub></i> ≤\n10) of the <i>m</i> games. If a duration is the <i>i</i><sup>th</sup> element in the space-separated list of integers, then it has a perceived enjoyment\nvalue equal to the <i>i</i><sup>th</sup> element in the space-separated list of floating-point values.",
  "Output": "For each of Max’s <i>n</i> requests, on its own line, print the maximum total average perceived happiness obtainable during\nthe Game Night. If this total is equal to 0, then instead print out the string “Should have picked better games...”.\nFloating point numbers should be expressed to two decimal places of precision."
}