{
  "Body": "Victoria sometimes gets frustrated while trying to generate good passwords and decided to dig a little deeper into the topic. She\ndiscovered that many systems now allow or require passphrases instead of passwords. A passphrase is a collection of “words”\nseparated by spaces and even punctuation marks. The idea is that a phrase of words, even if unrelated, can be remembered more\neasily than a 10-15 character password of seemingly random characters but no spaces. Longer has always been better when it\ncomes to passwords but computing power has advanced to a point that makes passwords shorter than 10 characters crack-able\nand passwords longer than 10 characters can be a challenge to remember. Passphrases are typically longer and the addition of\nspaces and use of all printable characters increases complexity for cracking which makes them stronger.\n\nAs with passwords, Victoria suspects that a scoring algorithm might help distinguish between just acceptable passphrases and\nexceptional passphrases. Here are the rules and scoring algorithm she has proposed and your challenge is to implement and test\nit.\n<b><u>Rules</u>:</b>\n<ol><li>A single “word” is a sequence of 1 or more non-blank printable characters and may contain letters, digits, punctuation\nmarks, and all other printable characters. A word could consist of all letters, all digits, all special characters, or any mix\nof those categories of characters. Uppercase and lowercase letters are different so “UIL” and “Uil” would be distinct\nwords as would be “2024” and “2024!”.</li><li>Passphrases must contain 4 or more distinct words separated by spaces, each word containing at least 4 non-blank\ncharacters. “UIL” would not count as a word but “2024” would count.</li><li>Words with less than 4 non-blank characters, like “UIL”, are not included in minimum word count but they do contribute\ntowards overall length and are eligible words for other scoring.</li><li>Minimum length of an acceptable passphrase is 20 characters including spaces.</li></ol>\n<b><u>Scoring</u>:</b><ol><li>Acceptable passphrases, those that satisfy ALL of the above rules, receive an initial score of 100 points while others\nreceive a final score of 0 and are not considered for bonuses and penalties.</li><li>Each additional word, including ones with length less than 4 characters, beyond the required minimum of 4 words results\nin a 10-point bonus.</li><li>Each word that contains a special character (non-letter and non-digit), even if it is a single character or a leading or\ntrailing punctuation mark, results in a 5-point bonus but multiple special characters within the same word do not add more\npoints.</li><li>Each word that contains a digit results in a 5-point bonus but multiple digits within the same word do not add more points.</li><li>Each word that contains letters that are only uppercase results in a 10-point bonus but only if less than half of the total\nwords contain letters that are only uppercase. The word may also contain non-letters.</li><li>A passphrase that contains more than one letter and uses only lowercase letters or only uppercase letters, even with digits\nand special characters results in a 10-point penalty.</li><li>Each complete word that matches another complete word results in a 20-point penalty for the matching pair. Test data\nwill not contain a set of 3 or more words that all match but there can be multiple distinct pairs of matching words.</li><li>Each complete word with a length greater than 2 characters that matches a prefix or suffix or both of another word results\nin 10-point penalties for each prefix or suffix match. The word itself is not penalized.</li></ol>\n<b><u>Rating Scale</u>:</b>\n<img/>\n\n<b><u>Examples</u>:</b><ul><li>“Start with a simple passphrase” has 4 words of at least 4 characters and 5 total words. It gets a 10-point\nword bonus for the fifth word with a total score of 110 and would be rated “Adequate”</li><li>“Add some extra digits & special chars!” has 5 words of at least 4 characters and 7 total words. It gets a\n30-point word bonus for the extra 4-char word along with “Add” and “&”. It also gets a 10-point special-char bonus\nfor “&” and “!” for a total score of 140 and would be rated “Strong”</li><li>“Computer Science UIL 2024!!” has only 3 words of at least 4 characters and is not eligible for any bonuses for\na total score of 0 and would be rated “Unacceptable”</li><li>“ing is a prefix of the word ingot and a suffix of confusing and challenging” has 6 words\nof at least 4 characters and 15 total words. It gets a 110-point word bonus for extra words. It also gets a 10-point\npenalty for not having different cases of letters. Words “a”, “of”, and “and” are matching pairs and receive a 60-\npoint penalty. “ing” is a prefix of “ingot” and gets a 10-point penalty. It is also a suffix of “confusing” and\n“challenging” and gets another 20-point penalty. The resulting total score is 110 and would be rated “Adequate”</li></ul>",
  "Input": "An unknown number of lines with a single passphrase on each line. The length of individual passphrases will not exceed\n80 characters. There will be no more than 50 lines in the judge’s data file. Lines may contain any of the common ASCII\nprintable characters between and including the space and the tilde. The data will not contain illegal characters.",
  "Output": "For each passphrase, output a single line containing its algorithm score followed by a colon (:) and the corresponding\npassphrase rating."
}