{
  "Body": "Danielle recently learned about different numerical bases, namely binary, octal, decimal, and hexadecimal. Danielle is already\ncomfortable with converting between bases but wanted to make an extension of this to reflect her exposure to music counting\npatterns. From her high school choir experience, she knows that, in a typical 4/4 pattern, musicians count beats within a measure\nas follows:\n\n\t1, 2, 3, 4;\t2, 2, 3 4;\t3, 2, 3, 4;\t4, 2, 3, 4;\t5, 2, 3, 4;\t6, 2, 3, 4;\t…\n\nHowever, Danielle is curious as to what will happen once the first number exceeds 9 (and therefore has more than one digit).\nUnfortunately for Danielle, she has never been able to figure this out in her choir class. Therefore, she has taken it upon herself\nto figure out exactly what this should look like.\n\nShe has devised the rule that, after a number in a given significant position reaches the value 9, attempting to add one more to\nthat will instead reset that number back to its original value, and increment the number in the next significant position. Note\nthat, unlike a typical mathematical base/counting system, the least significant digit is the left-most digit, while the most\nsignificant digit is the right-most digit. Moreover, not all positions reset back to the same number when they go past the\nmaximum value (in this case, 9). Depending on how significant a digit is, it will reset to a different number. The least\nsignificant digit will reset back to 1, the second least-significant digit will reset back to 2, the third least-significant digit will\nreset back to 3, and the most-significant digit will reset back to 4. Help Danielle develop a program that converts from her\nmusical notation back to the measure she is currently on.",
  "Input": "The first line of input will consist of a single integer <i>n</i> (1 ≤ <i>n</i> ≤ 500) denoting the number of test cases to follow. The\nnext <i>n</i> test cases will consist of a single line that denotes the musical notation of which beat of which measure Danielle has\ncurrently counted to. This line will be in the format of \"<i>d</i><sub>1</sub>,<i>d</i><sub>2</sub>,<i>d</i><sub>3</sub>,<i>d</i><sub>4</sub>\" where <i>d</i><sub>1</sub>,<i>d</i><sub>2</sub>,<i>d</i><sub>3</sub>, and <i>d</i><sub>4</sub> are all integers and <i>d</i><sub>1</sub> ∈ [1,9],\n<i>d</i><sub>2</sub> ∈ [2,9], <i>d</i><sub>3</sub> ∈ [3,9], and <i>d</i><sub>4</sub> ∈ [4,9].",
  "Output": "For each of Danielle’s <i>n</i> requests, print out the which measure she has counted to."
}