{
  "Body": "Dorian is putting the final touches on the problems that he wrote for his school’s upcoming Competitive Programming\ninvitational and now needs to write the Judge Documents for his problems. However, Dorian finds himself in a bit of a pickle\nsince his judge data is really, really long and doesn’t want to format it by hand when copying it over from the raw files into the\nWord/PDF documents. Namely, when a line of input or output goes beyond 89 characters, that line will need to be broken down\ninto multiple lines, each additional line beyond the first needing to be indented with a “tab” (which you should treat as 6 spaces)\nto show continuity. However, he doesn’t want to willy-nilly break down a long line – namely, he never wants to break a\ncontiguous set of non-whitespace characters up, even if it means having an excessive number of continued lines, thus wasting a\nfair bit of otherwise usable space. Knowing that a set of contiguous non-whitespace characters that go beyond 89 characters\nlong (even 83 for indented lines) pose a challenge to his desired format, Dorian has specially crafted his problems to ensure that\nthis never happens. Dorian would normally write this program himself, but he is quite tired after writing 12 problems for his\ncontest. Help Dorian by writing a program that, given a raw data file, formats it in Dorian’s desired format.",
  "Input": "The input will consist of an unknown number of lines, each line of input will consist of, at minimum, one nonwhitespace character. The first line of input that is empty or does not consist of any non-whitespace character will denote the\nend of the input.",
  "Output": "For each line of input, output a new (potentially more than one) line(s) of output that is formatted per Dorian’s request.\nNote that internal whitespace within a line of input should be respected in the output unless doing so would either cause Dorian’s\nrule about contiguous non-whitespace characters to be violated, or if it were to cause the first non-tab character on a “continued\nline” to be a non-whitespace character. In such cases, the original whitespace should be completely ignored and disregarded in\nthe output."
}