{
  "Body": "Pankaj will be working for the Ultimate Intelligent Learners Summer camp in the summer of 2022. This camp is geared towards\ngetting the campers to make new friends within their own community and the surrounding areas. This means there is the\npotential for a camper to know zero, one, or more than one of the other campers attending any given session.\n\nThe camp counselors have asked Pankaj to take a list of campers as well as a list of known relationships, and determine if the\ncampers can be broken into two distinct groups such that no two campers in a group have a relationship with anyone else in the\ngroup. Remember, the focus of this camp is to get the campers to make new friends, and how can you make new friends with\npeople you already know?\n\nCan you help Pankaj write a program to determine whether it is possible or impossible to break a group of campers up into two\ndistinct groups such that no two campers know anyone else in their group?",
  "Input": "The input will consist of an integer I, the number of test cases. I will be in the range of [1,20]. For each test case, input\nwill consist of two lines. Line 1 will contain the name of all the campers attending a given session. Names will be limited to first\nnames only, and only one word first names. It will be guaranteed that no two campers have the same exact first name. Names in\nthe list will be separated by a comma “,” and there will be no spaces in the list. Line 2 will consist of the known relationships\nbetween the campers. The relationships will be given in the form: “camper1<->camper2” this means that camper1 knows\ncamper2 and camper2 knows camper1. A relationship in this problem is always two-way, each camper will know the other\ncamper if a relationship is present. Relationships will be separated by a comma “,” and there will be no spaces in the list. There\nwill be at least one relationship present between two campers, but potentially more.",
  "Output": "For each test case, you are to output “Test Case #: possible” if the campers can be broken into two distinct groups such\nthat know two campers know each other or “Test Case#: impossible” if the campers can not be broken into two such groups."
}