{
  "Body": "After the reposts about shortages of Christmas trees this past year, Shirley thought it might be interesting to analyze aerial data\nfrom Christmas tree farms. Current generation mapping drones have amazing resolution capabilities and artificial intelligence\n(AI) processing of photographs have become astounding!\n\nShirley found some data but needs help from the UIL programming team to reduce the data into something she can work with.\nThe data she was able to obtain consists of grids of 1-acre (4,840 square yards) square plots with an estimate of the number of\ntrees in that plot. A typical tree farm can vary in their density but seem to hover around 1500 trees per acre. Annual harvesting\nis usually limited to about 12.5% of the trees to support regeneration on an 8-year cycle with annual harvesting for Christmas.\nShirley is an aspiring environmentalist not a computer scientist studying programming and does not view a grid as a zero-base\narray like most programmers.\n\n<img/>\n\nA cluster is 2 or more adjacent plots that each contain 250 or more estimated trees. Adjacent cells are those that have a common\nedge, not a just a corner. However, a cluster can wrap around a plot or group of plots that contain low numbers. For each grid,\nShirley would like a list of the 3 largest clusters in the grid with the total estimated number of trees in the cluster and the\npercentage of the grid it covers. For the 6 x 7 grid above, the cluster that includes the plot (1, 1) contains 8635 trees and covers 6\nplots which is 14.3% of the total grid.\n\nLet’s help Shirley with her analysis of Christmas tree data!",
  "Input": "The first line is a positive integer 1 ≤ T ≤ 10, the number of test cases in the data file. That will then be followed by T\nsets of data. For each dataset, the first line will contain 2 integers: the number of rows (R) and the number of columns (C) with 2\n≤ R, C ≤ 15. The dataset continues with R rows, each containing C integers (N) to populate the individual array cells with 0 ≤ N\n≤ 2000. All items are whitespace delimited.",
  "Output": "For each test case, the first line contains a case number, formatted as shown in sample. The next three lines contain the\ntree counts and grid percentages, separated by one space, for the largest three clusters from largest count to smallest count. If\nthere are less than three clusters, the later lines will display NONE instead of a count and percentage. The final line for each test\ncase will contain 12 carats “^^^^^^^^^^^^”. There are no blank lines."
}