{
  "Body": "Fai just got a job working for the UIL’s virtual reality team. In an attempt to get all K-12 students more familiar with their\nassigned district, the UIL wants to make a warped speed video showing what each student would see on a bus ride to another\nschool’s city or town. This way, students will have a general idea as to what they will see out of their school bus window before\never making the trek to the other campus.\n\nTo accomplish this, the UIL virtual reality team has provided Fai with a 360-degree camera attached to the top of her car. Fai\nknows she needs to drive every single road between two cities exactly one time to record the street view, so that all possible\nroutes have been recorded. With the rising price of fuel, and in an attempt to be as efficient as Fai can be with her time, Fai\nknows she needs to start recording and end recording in the same city, if possible. With the task of driving every single road, Fai\nknows she may visit the same city or town multiple times, which is okay, she just has to travel all the given roads the UIL\nassigns to her to drive.\n\nFor example, say that City A, City B, City, C, City D, City E, and City F are all in the same district and the following roads\nexist: City A<->City B,City A<->City C,City A<->City E,City A<->City D,City B<->City C,\nCity C<->City F,City C<->City E,City F<->City E,City E<->City D. If Fai were to start in City A she could do the following\nroad traversal to cover all roads exactly once, starting and stopping from City A:\n\n<img/>\n\n\tCity A -> City D -> City E -> City F -> City C -> City B -> City A -> City E -> City C -> City A\n\nCan you help Fai write a program that, given a district and all the roads between cities or towns, can determine if it’s possible to\ndrive all roads starting and stopping from a given city or town?",
  "Input": "The input will consist of an integer <i>T</i>, the number of test cases. <i>T</i> will be in the range of [1,10]. For each test case, input will consist of\nfour lines. Line 1 will contain the name of all the cities or towns in the district. The number of cities or towns will be greater than or equal to\ntwo, and will not exceed 10.. Cities or towns are not limited to one word names. It will be guaranteed that no two cities or towns have the same\nexact name. Names in the list will be separated by a comma “,”. Line 2 contains the name of the start city or town where Fai will begin\nrecording street views. Line 3 will consist of the roads Fai has been assigned to record by the UIL. The roads will be given in the form:\n“Name1<->Name2” this means a road exists between Name1 and Name2 and must be driven by Fai exactly once. A road in this problem is\nalways two-way. Roads will be separated by a comma “,”. There will be at least one road present and there will always exist a path, or series of\nroad(s), between two cities or towns. Line 4 is 20 dashes and serves to separate all test cases.",
  "Output": "For each test case, you are to output “Test Case #: possible” if Fai can start and stop at the given start city, traversing each road\nexactly once or “Test Case#: impossible” if Fai cannot start and stop at the given start city, traversing each road exactly once."
}