{
  "Body": "Ricardo has been following his New Years resolution of regularly going to the gym. At this point in time, he has gotten\ncomfortable with many different exercises. In fact, he is comfortable with so many exercises, he has decision paralysis and\ncannot decide which exercises to do when he goes to the gym.\n\nTo help with this, Ricardo has developed \"workout plans\". Each workout plan is one of the following:\n<ol><li>A single exercise (e.g. \"squats\"). All exercise names are made of lowercase English letters.</li>\n<li>An option between multiple workout plans. These are surrounded by parentheses and separated by '|' characters. (e.g.\n\"(rows|curls)\"). This means that Ricardo can choose to either do rows or curls.</li>\n<li>A sequence of workout plans in order. These are surrounded by parentheses and separated by ',' characters. (e.g.\n\"(running,deadlift,stretch)\"). This means that Ricardo runs, then does deadlifts, then stretches.</li></ol>\n\nSince workout plans can nest, these plans can get quite complicated, and there can be many options. Now, Ricardo is wondering,\nhow many different workouts can he complete given a plan? Two plans are different if Ricardo makes a different decision when\npresented with an option. Note that different exercises can have the same label. For example, there are two different workouts for\nthe plan \"(a|a)\".",
  "Input": "The first line of input is T (1 <= T <= 30), the number of test cases. Each test case is a single workout plan. Each workout plan\nconsists only of lowercase letters, parentheses, and the '|' and ',' characters. No workout plan has more than 200 characters.",
  "Output": "For each test case, output the number of workout plans that Ricardo can do. Format your answer with the case number as in the\nsamples. It can be proven that given the bounds on the input data, the total number of workouts will fit into a signed 64-bit\ninteger data type.",
  "Note Header": "Sample Explanation",
  "Note": "In the third test case, these are the possible workouts:\n<ol><li>lunge, rows, squats</li>\n<li>lunge, rows, press</li>\n<li>lunge, curls, squats</li>\n<li>lunge, curls, press</li></ol>"
}