{
  "Body": "In Shivam’s Algebra I class, Shivam’s teacher just taught his class about quadratic functions. A quadratic function is any\nfunction that can be written in the form: <i>f</i>(<i>x</i>) = <i>ax</i><sup>2</sup> + <i>bx</i> + <i>c</i> where <i>x</i> represents an unknown variable, the coefficients of the\nfunction are <i>a</i>, b, and <i>c</i>, and <i>a</i> ≠ 0. When graphed on the <i>x</i>𝑦 plane, quadratics are known for their “U” shaped appearance. For\nexample, the function <i>f</i>(<i>x</i>) = <i>x</i><sup>2</sup> − 8<i>x</i> + 15 is graphed below:\n\n<img/>\n\nWhere the function intersects the <i>x</i> axis, of the <i>xy</i> plane, is known as the function’s root(s). In the above example, the function\nhas two real roots, one at (3.00,0.00) and another at (5.00,0.00). Not all quadratics have two real roots, though. For example,\nthe function <i>f</i>(<i>x</i>) = <i>x</i><sup>2</sup> − 8<i>x</i> + 16 only has one real root at (4.00,0.00) and is graphed below:\n\n<img/>\n\nSome quadratics have no real roots meaning their graph does not intersect the <i>x</i> axis at all. For example, the function <i>f</i>(<i>x</i>) =\n<i>x</i><sup>2</sup> − 4<i>x</i> + 10, which is graphed below, shows an example of a quadratic that doesn’t intersect the <i>x</i> axis at all.\n\n<img/>\n\nShivam needs your help writing a program that can read in a quadratic function <i>f</i>(<i>x</i>), determine the number of roots, and where\nthose roots are. Can you help him with this?",
  "Input": "The input will consist of an integer <i>F</i>, the number of functions. <i>F</i> will be in the range of <i>[1,20]</i>. The following <i>F</i> lines\nwill each contain a single function <i>f</i>(<i>x</i>) of the form f(x)=ax^2+bx+c. There will be no spaces in the function input. For\nthis program, the caret operator (^) will be used for exponents and not the xor operator. a will be in range of [−100,0) ∪\n(0,100], b and c will be in range [−100,100]. <i>a</i>, <i>b</i>, and <i>c</i> are all guaranteed to be integers, but <i>b</i> and/or <i>c</i> are not guaranteed to\nbe present in the function input. For example, the function f(x)=4x^2+8 is a legal input in which only coefficients <i>a</i> and <i>c</i> are\npresent.",
  "Output": "For functions with two real roots, you are to output “Function #: There are two real roots at\n(ROOT1_X,ROOT1_Y) and (ROOT2_X,ROOT2_Y).” Roots should be displayed in ascending order according to the x\ncomponent and rounded to two decimal places. For functions with one real root, you are to output “Function #: There\nis one real root at (ROOT1_X,ROOT1_Y).” The root should be rounded to two decimal places. For functions\nwith no real roots, you are to output “Function #: There are no real roots to the function.”"
}