{
  "Body": "The search for new habitable land is on! The Universe's Inhabitation Legion (UIL) is on the hunt for new places for the galaxy's\ndisplaced to live. Currently, the UIL is investigating the distant planet Xae-12, which was thought to be inhospitable to humans.\n\nOn Xae-12, humans cannot survive on the mainland because of human-hunting predators. However, the UIL has found a large\nlake. Inside the lake are islands which are devoid of any predators. These islands warrant further investigation, but the UIL only\nhas grainy images to work with. Each image is an R by C grid of tiles, and each tile is either water or land. Two tiles are\nconnected if they share an edge. In the photos the UIL has taken, there is at most one connected body of water (the lake), and\npotentially many connected bodies of land. A connected region of land is an island if it is fully within the lake. Any land on the\nborder of the image can be assumed to be mainland, and not an island.\n\nCan you write a program to help the UIL find all islands in the lake, and their sizes? The size of an island is the number of cells\nit takes up in the image. Output the sizes in descending order.",
  "Input": "The first line of input is T (1 <= T <= 20), the number of test cases. Each test case starts with two integers R and C (3 <= R, C\n<= 100), the number of rows and columns in the input image respectively. Then follow R lines with C characters each. All\ncharacters are either '.', signifying land, or 'W', signifying water. In each test case, there is at most one connected body of\nwater.",
  "Output": "For each test case, output two lines. On the first line, output the case number and the total number of islands, formatted as in the\nsamples. On the second line, output a space separated list of island sizes. Output the island sizes in descending order. If there are\nno islands in the image, output the string \"NONE\".",
  "Note Header": "Sample Explanation",
  "Note": "In the first test case, there are two masses of land. The landmass in the upper right is part of the mainland, so there is only one\nisland of size 2.\n\nIn the second test case, there are no islands.\n\nIn the third test case, there are two islands. The land in each corner of the image is part of the mainland."
}