{
  "Body": "Harmony is fascinated with Web sites that display a password strength for new passwords. She has developed a new scoring\nalgorithm of her own and needs help to code a solution. She found a list of most commonly used passwords for 2023\n(https://nordpass.com/most-common-passwords-list/) and a string of letters from Wikipedia with the most frequently used to\nleast frequently used letters based on words from the Concise Oxford English Dictionary. That list of letters,\n<b>EARIOTNSLCUDPMHGBFYWKVXZJQ</b>, identifies the letter <b>E</b> as the most often occurring letter in English words, with letter <b>A</b>\nnext, and letter <b>Q</b> as the least often occurring letter.\n\nThe scoring rules of her algorithm are as follows:\n\nMatch any of the top 100 common passwords, results in score of 0\n• Length less than 8 characters results in score of 0\n• Does not contain at least 3 of the 4 character categories: lowercase letters, uppercase letters, digits, and special\ncharacters, results in score of 0\n• Passwords not excluded by the above criteria are scored based on character content\n• Letters, regardless of case, found in the <b>first</b> half of the highest-to-lowest used letters list earn 1 point each\n• Letters, regardless of case, found in the <b>last</b> half of the highest-to-lowest used letters list earn 3 points each\n• Digits earn 3 points each\n• Special characters earn 5 points each\n• Using all 4 categories (uppercase, lowercase, digits, special characters) earns +5 bonus points\n• Lengths greater than 10 characters earn +3 bonus points for each extra character\n• Category change between sequential characters (e.g., letter to digit, uppercase to lowercase, etc.) earns +3 bonus points\nfor each change. “UiL” as part of a password would earn +3 bonus points each for “Ui” and “iL” case changes and “u-\nn” would earn +3 bonus points each for “u-” and “-n”.\n• Sequentially repeated characters, of same case for letters, earn a −2 point penalty for each repetition. For example,\n“sss” as part of a password would earn points for the individual characters but get penalized −2 points each for the\nsecond and third sequential occurrence of the same character ‘s’; same would apply for repeated digits or special\ncharacters.\n\nStrength ratings based on total scores:\n\n• 0 points and lower → UNACCEPTABLE\n• 1 – 20 points → WEAK\n• 21 – 35 points → FAIR\n• 36 – 50 points → GOOD\n• 51 points and higher → STRONG\n\nExamples:\n\n• “password” and “qwerty123” score 0: in list of most common passwords\n• “pass1234” scores 0: contains only 2 categories of characters: lowercase and digits\n• “fgh123$” scores 0: length less than 8 characters\n• “Qwerty123” scores 27 points: 21 character points with +6 bonus for “Qw” and “y1” category changes\n• “0circleS” scores 16 points: 10 character points and +6 bonus for “0c” and “eS” category changes\n• “UiL+2024” scores 37 points: 20 character points with +5 bonus points for using all 4 categories and\n+12 bonus points for category changes “Ui”, “iL”, “L+”, and “+2”\n• “u20-IL_24” scores 45 points: 25 character points with +5 bonus points for using all 4 categories and\n+15 bonus points for 5 category changes “u2”, “0-”, “-I”, “L_”, and “_1”\n• “Sxxxxxxx0” and “W0000000s” both score 19 points: 25 character points with +6 bonus points for\n2 category changes and −12 penalty points for 6 repeated ‘x’ and ‘0’ after the initial characters\n• “Pass12345!” scores 36 points: 24 character points with +5 bonus points for using all 4 categories and\n+9 bonus points for 3 category changes and −2 penalty points for repeated ‘s’\n• “ABZYcdx[3-2-1-0]” scores 105 points: 52 character points with +5 bonus points for using all\n4 categories and +30 bonus points for 10 category changes and +18 bonus points for 6 extra characters",
  "Input": "First line contains 26 uppercase letters with no spacing, the highest-to-lowest use ranking of letters. Second line\ncontains allowable special characters. The next ten lines contain the 100 most commonly used passwords in the U.S. for 2023 in\ndecreasing order (https://nordpass.com/most-common-passwords-list/). There are ten passwords per line separated by commas.\nThe remaining lines, maximum of 25, contain one password per line to be rated for strength. Passwords will not contain spaces\nor commas and will not exceed 20 characters in length",
  "Output": "For each password, display one line of output with the password followed by a colon ‘:’ followed by the calculated\nscore and another colon ‘:’ followed by the strength rating. There must be no additional spacing"
}