{
  "Body": "Jared recently discovered a new up-and-coming game with a key mechanic known as “Stratagems.” These Stratagems allow the\nplayer to input a unique code using the left, up, down, and right arrow keys, which allows them to trigger a special ability.\nHowever, through his own playing of the game, he found himself oftentimes struggling to input the codes for these various\nStratagems in the heat of the moment. However, after looking into why he was struggling so much, he discovered a fatal flaw\nwith the input codes for the Stratagems: some of the codes are prefixes of other codes!\n\n<img/>\n\nThe tree above represents the current state of Jared’s Stratagem inputs. Note that the input “↑” is a prefix for the input “↑←” and\n“↑↑”.\n\n<img/>\n\nThe tree above represents Jared’s modified set of inputs where no Stratagem input is the prefix of any other Stratagem input.\nBefore Jared decides to convince his friends to buy the game and play it with him, he wants to make sure that no two Stratagem\ninput codes are prefixes of one another. Help Jared write a program that, given a set of Stratagem input codes, determines if no\nStratagem input code is the prefix of any other Stratagem input, and, if there does exist such a pair of input codes, how many\nthere are.",
  "Input": "The first line of input will consist of a single integer, 1 ≤ <i>n</i> ≤ 50, denoting the number of testcases to follow. Each of\nthe next <i>n</i> lines will consist of a comma-separated list of Stratagem inputs, which are denoted with the letters ‘U’ for up, ‘D’ for\ndown, ‘L’ for left, and ‘R’ for right. It is guaranteed that the length of any given stratagem input will be between 1 and 10\ncharacters in length, and that there will be between 1 and 100 stratagem inputs for any arbitrary request.",
  "Output": "For each of Jared’s <i>n</i> requests, on their own line, if there are no Stratagem inputs which are a prefix of any other\nStratagem inputs, output the string “Democracy Prevails!” If, however, there exists some set of invalid Stratagem inputs,\noutput the string “There are <#> misinputs...” where <#> is the number of pairs of inputs in which one input is the\nprefix for the other input."
}