{
  "Body": "Sasha has recently taken an interest in the physics of rainwater in a 2D space and wants to be able to visualize what would\nhappen to a 2D space with a series of concrete, nonabsorbent columns, should it rain for an arbitrarily long period of time. The\nfollowing markup is an example of what such a 2D space of columns might look like (assume that the only columns that exist in\nthis 2D space are those which are explicitly stated):\n\n<img/>\n\nSasha discovered that rainwater would collect into certain “buckets” which lie between the different concrete, nonabsorbent\ncolumns. Assume that water tension does not exist in this 2D space, as well as any excess water which would result from\noverflowing from a bucket gets absorbed into the ground surrounding the left and right most columns, effectively voiding any\nrunoff. Sasha manually determined that the following buckets would form from the example above in such a scenario:\n\n<img/>\n\nHowever, Sasha wishes to automate this process. Help Sasha write a program that, given a list of column heights, determines the\ntotal amount of water that is contained within each bucket, as well as the entire 2D plane.",
  "Input": "The first line of input will consist of a single integer, 1 ≤ <i>n</i> ≤ 100, denoting the number of testcases to follow. The next\n<i>n</i> pairs of lines will start with a line consisting of a single integer, 1 ≤ <i>m</i> ≤ 200, denoting the number of columns for the current\ntest case, which are labeled <i>c</i><sub>0</sub>, <i>c</i><sub>1</sub>, … , <i>c</i><sub>m-1</sub>. The second line consists of <i>m</i> space-separated integers which denote the height of\nthe columns, labeled <i>h</i><sub>0</sub>, <i>h</i><sub>1</sub>, … , <i>h</i><sub>m-1</sub>. It should be noted that any arbitrary column, <i>c</i><sub>i</sub>, has a width spanning from <i>x</i> = <i>i</i> to <i>x</i> =\n<i>i</i> + 1 and a height spanning from <i>y</i> = 0 to <i>y</i> = <i>h</i><sub>i</sub>, with 0 ≤ <i>h</i><sub>i</sub> ≤ 10<sup>4</sup>.",
  "Output": "For each of Sasha’s <i>n</i> requests, first determine if there are any buckets that would form if it were to rain for an\narbitrarily long period of time to fill any given bucket. If there does not exist any such bucket, then print the string “Dry as a\nBone...”. If there does exist such a bucket, then, on the same line, for each bucket <i>b</i><sub>0</sub>, <i>b</i><sub>1</sub>, … , <i>b</i><sub>k</sub>, with <i>b</i><sub>0</sub> being the left-most\nbucket and <i>b</i><sub>k</sub>, being the right-most bucket, print the total “volume” (surface area since we are dealing in a 2D plane) of water\nthat each of those buckets can hold, each separated by a space, followed by the total volume of all buckets combined."
}