{
  "Body": "You and your friend Wesley have been trapped in a dimensional maze by some loser whose name doesn’t even matter for the\nproblem. You need to escape the maze, that’s it, but plot twist, this isn’t just any normal maze, because that would be too easy\nfor you. This maze shifts dimensions. The maze runs on a 5 second cycle, beginning in second 1, and as every step takes 1\nsecond, the maze will shift for every step you take. When stepping, you will need to make sure your step is into a space that is\nvalid in the next dimension, as the dimensions will change as you step. You can only take steps in the 4 cardinal directions (up,\ndown, left, right), no diagonals. The different dimensions will be explained in the Dimensions section. The maze will be made\nup of only the following characters:\n\n● 'S' – This character denotes your starting point in the maze. This space will always be passable, except when in\ndimension 4.\n● 'E' – This character denotes the exit from the maze. This space will always be passable, except in dimension 4 (in\ndimension 4, you cannot escape).\n● '1' – This character represents a wall that disappears when in dimension 1. When it comes to any other dimension, it\nshould be treated as a wall.\n● '3' – This character represents a wall that disappears when in dimension 3. When it comes to any other dimension, it\nshould be treated as a wall.\n● '5' – This character represents a wall that disappears when in dimension 5. When it comes to any other dimension, it\nshould be treated as a wall.\n● '#' – This character represents a wall. This object is impassable, unless you are in dimensions 2 or 4.\n● '.' – This character represents an empty space. This is always passable, except in dimension 4.\n● Dimensional Walls: In the following section '1', '3', and '5' will be referred to as dimensional walls.\n● There is not guaranteed to be an exit from the maze.\n\nDimensions:\n\n● Dimension 1: You begin in dimension 1. All characters are as listed above, except the walls marked '1' are now empty\nspaces. When you take a step (1 second passes), you move to dimension 2.\n● Dimension 2: This is the rest dimension. All the spaces in the maze turn into empty space, walls and dimensional walls\nincluded. When you take a step (1 second passes), you move to dimension 3.\n● Dimension 3: This is similar to dimension 1. All characters are as listed above, except the walls marked '3' are now\nempty spaces. When you take a step (1 second passes), you move to dimension 4.\n● Dimension 4: This is the backwards dimension. All walls are now open spaces (including dimensional walls), and all\nopen spaces are now walls. When you take a step (1 second passes), you move to dimension 5.\n● Dimension 5: This is similar to dimension 1. All characters are as listed above, except the walls marked '5' are now\nempty spaces. When you take a step (1 second passes), you move back to dimension 1.",
  "Input": "The input will begin with an integer, n (0 < n <= 1000), denoting the number of test cases to follow. Each test case\nwill begin with 2 space-separated integers, r and c, denoting the number of rows and columns in the maze. Each of the\nfollowing r lines will contain c characters denoting a row the maze.",
  "Output": "For each test case, first output the string \"Test Case #n: \", where n should be replaced by the number of the test\ncase, starting with 1. If it is possible to escape the maze, output \"The Great Escape.\" If escape is impossible, output\n\"Guess I won't be home in time for dinner.\"."
}